X=[2243.8,1983.8,2252.8,2216.2,2619.6,2565.1,2602.4...
    2882.3,2607.99,2855.71,2896.8,3130.1,2849.2,3114.4,3171.3...
    3474.71,3096.09,3370.83,3529.82,3846.32,3471.85,3877.22,3965.5...
    4320.13,3873.64,4183.43,4297.1,4634.7,4149.6,4534.7,4704];
%数据为我国2006-2013年各季城镇居民人均消费支出
t=1:length(X);
plot(t,X,'-o')
xlabel('时间/季度')
ylabel('人均消费性支出/元')

%计算各年同季平均数
r1=mean(X(1:4:length(X)));
r2=mean(X(2:4:length(X)));
r3=mean(X(3:4:length(X)));
r4=mean(X(4:4:length(X)));
r=[r1,r2,r3,r4]   %各年同季平均
%计算趋势预测值
p=polyfit(t,X,1)   %拟合的长期趋势参数
T=polyval(p,t)     %计算长期趋势预测值
%计算趋势值各年同季平均
R1=mean(T(1:4:length(T)));
R2=mean(T(2:4:length(T)));
R3=mean(T(3:4:length(T)));
R4=mean(T(4:4:length(T))); 
R=[R1,R2,R3,R4]    %趋势值各年同季平均
%计算并调整趋势季节指数
k=r./R            %趋势季节指数
K=4/sum(k)*k      %调整趋势季节指数
%预测未来各季度销售量
t1=length(X)+1:length(X)+4  %2014年1~4季度时间
Y=K.*polyval(p,t1)          %计算2014年预测值
plot(t,X,'-o',t,T,t1,Y)